spec/fixtures/stripe_charges.json

[
  {
    "id": "ch_1I1sjeBqdummy94dh06xTnx",
    "object": "charge",
    "amount": 25120,
    "amount_captured": 25120,
    "amount_refunded": 0,
    "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
    "application_fee": null,
    "application_fee_amount": null,
    "balance_transaction": {
      "id": "txn_1I1sdummyNmWB",
      "object": "balance_transaction",
      "amount": 248687,
      "available_on": 1609372800,
      "created": 1608812162,
      "currency": "sek",
      "description": "ORD001737: ISO 56002 Innovation Management - Eicorn Academy",
      "exchange_rate": 9.89996,
      "fee": 3662,
      "fee_details": [
        {
          "amount": 3662,
          "application": null,
          "currency": "sek",
          "description": "Stripe processing fees",
          "type": "stripe_fee"
        }
      ],
      "net": 245025,
      "reporting_category": "charge",
      "source": {
        "id": "ch_1I1sjeBqdummy94dh06xTnx",
        "object": "charge",
        "amount": 25120,
        "amount_captured": 25120,
        "amount_refunded": 0,
        "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_1I1sdummy4sa82NmWB",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": null,
          "name": null,
          "phone": null
        },
        "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
        "captured": true,
        "created": 1608812162,
        "currency": "eur",
        "customer": "cus_IcsdummyFHz",
        "description": "ORD001737: ISO 56002 Innovation Management - Eicorn Academy",
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": true,
        "metadata": {
          "order_id": "20679297",
          "first_name": "dummy",
          "last_name": "name",
          "email": "another_dummy@example.com",
          "ip_address": "79.9.102.47",
          "company_or_organisation": "Project Dummy",
          "country": "IT"
        },
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_1I1sjeBqidummycmgk3hI",
        "payment_method": "pm_1I1cMIdummyuSSxwro",
        "payment_method_details": {
          "card": {
            "brand": "mastercard",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": null
            },
            "country": "IT",
            "exp_month": 7,
            "exp_year": 2021,
            "fingerprint": "dummy",
            "funding": "prepaid",
            "installments": null,
            "last4": "0000",
            "network": "mastercard",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1I1sjeBqdummy94dh06xTnx/rcpt_Id91eUPCSmxwQ6KC06HgpjAXU3clFtE",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_1I1sjeBqdummy94dh06xTnx/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      },
      "status": "available",
      "type": "charge"
    },
    "billing_details": {
      "address": {
        "city": null,
        "country": null,
        "line1": null,
        "line2": null,
        "postal_code": null,
        "state": null
      },
      "email": null,
      "name": null,
      "phone": null
    },
    "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
    "captured": true,
    "created": 1608812162,
    "currency": "eur",
    "customer": "cus_IdummyM0lzFHz",
    "description": "ORD001737: ISO 56002 Innovation Management - Eicorn Academy",
    "destination": null,
    "dispute": null,
    "disputed": false,
    "failure_code": null,
    "failure_message": null,
    "fraud_details": {},
    "invoice": null,
    "livemode": true,
    "metadata": {
      "order_id": "20679297",
      "first_name": "dummy",
      "last_name": "name",
      "email": "another_dummy@example.com",
      "ip_address": "79.9.102.47",
      "company_or_organisation": "Project sas",
      "country": "IT"
    },
    "on_behalf_of": null,
    "order": null,
    "outcome": {
      "network_status": "approved_by_network",
      "reason": null,
      "risk_level": "normal",
      "seller_message": "Payment complete.",
      "type": "authorized"
    },
    "paid": true,
    "payment_intent": "pi_1I1sjeBdummygk3hI",
    "payment_method": "pm_1I1cMIdummyduSSxwro",
    "payment_method_details": {
      "card": {
        "brand": "mastercard",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": null,
          "cvc_check": null
        },
        "country": "IT",
        "exp_month": 7,
        "exp_year": 2021,
        "fingerprint": "dummy",
        "funding": "prepaid",
        "installments": null,
        "last4": "0000",
        "network": "mastercard",
        "three_d_secure": null,
        "wallet": null
      },
      "type": "card"
    },
    "receipt_email": null,
    "receipt_number": null,
    "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1I1sjeBqdummy94dh06xTnx/rcpt_Id91eUPCSmxwQ6KC06HgpjAXU3clFtE",
    "refunded": false,
    "refunds": {
      "object": "list",
      "data": [],
      "has_more": false,
      "total_count": 0,
      "url": "/v1/charges/ch_1I1sjeBqdummy94dh06xTnx/refunds"
    },
    "review": null,
    "shipping": null,
    "source": null,
    "source_transfer": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
  },
  {
    "id": "ch_1HzfzLdummy4yFq78N8g",
    "object": "charge",
    "amount": 24900,
    "amount_captured": 24900,
    "amount_refunded": 0,
    "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
    "application_fee": null,
    "application_fee_amount": null,
    "balance_transaction": {
      "id": "txn_1HzfzdummyY1CMVhu",
      "object": "balance_transaction",
      "amount": 247841,
      "available_on": 1608854400,
      "created": 1608286507,
      "currency": "sek",
      "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
      "exchange_rate": 9.95347,
      "fee": 3650,
      "fee_details": [
        {
          "amount": 3650,
          "application": null,
          "currency": "sek",
          "description": "Stripe processing fees",
          "type": "stripe_fee"
        }
      ],
      "net": 244191,
      "reporting_category": "charge",
      "source": {
        "id": "ch_1HzfzLdummy4yFq78N8g",
        "object": "charge",
        "amount": 24900,
        "amount_captured": 24900,
        "amount_refunded": 0,
        "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_1HzfzMdummyyY1CMVhu",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": null,
          "name": null,
          "phone": null
        },
        "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
        "captured": true,
        "created": 1608286507,
        "currency": "eur",
        "customer": "cus_IariEjS2GmHx4Q",
        "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": true,
        "metadata": {
          "order_id": "20498975",
          "first_name": "dummy",
          "last_name": "dummy",
          "email": "dummy@example.com",
          "ip_address": "127.0.0.1",
          "company_or_organisation": "Company of Sweden",
          "country": "FR"
        },
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_1HzfzdummyKqUb2QX",
        "payment_method": "pm_1HzfzdummyRT944WU5HmfV",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "FR",
            "exp_month": 12,
            "exp_year": 2022,
            "fingerprint": "9pkeomJm2vka5hMa",
            "funding": "credit",
            "installments": null,
            "last4": "5888",
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": "1699-7914",
        "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1HzfzLdummy4yFq78N8g/rcpt_IariaXFSdPG1xnI17OkxV4HnBBJON6r",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_1HzfzLdummy4yFq78N8g/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      },
      "status": "available",
      "type": "charge"
    },
    "billing_details": {
      "address": {
        "city": null,
        "country": null,
        "line1": null,
        "line2": null,
        "postal_code": null,
        "state": null
      },
      "email": null,
      "name": null,
      "phone": null
    },
    "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
    "captured": true,
    "created": 1608286507,
    "currency": "eur",
    "customer": "cus_dummyS2GmHx4Q",
    "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
    "destination": null,
    "dispute": null,
    "disputed": false,
    "failure_code": null,
    "failure_message": null,
    "fraud_details": {},
    "invoice": null,
    "livemode": true,
    "metadata": {
      "order_id": "20498975",
      "first_name": "Ramona",
      "last_name": "Ungureanu",
      "email": "dummy@example.com",
      "ip_address": "192.168.0.1",
      "company_or_organisation": "Company of Sweden",
      "country": "FR"
    },
    "on_behalf_of": null,
    "order": null,
    "outcome": {
      "network_status": "approved_by_network",
      "reason": null,
      "risk_level": "normal",
      "seller_message": "Payment complete.",
      "type": "authorized"
    },
    "paid": true,
    "payment_intent": "pi_1HzfzLBqiGHfRT94AKqUb2QX",
    "payment_method": "pm_1HzfzdummyRT944WU5HmfV",
    "payment_method_details": {
      "card": {
        "brand": "visa",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": null,
          "cvc_check": "pass"
        },
        "country": "FR",
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "dummy",
        "funding": "credit",
        "installments": null,
        "last4": "5888",
        "network": "visa",
        "three_d_secure": null,
        "wallet": null
      },
      "type": "card"
    },
    "receipt_email": null,
    "receipt_number": "1699-7914",
    "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1HdummyFq78N8g/rcpt_IariaXdummynBBJON6r",
    "refunded": false,
    "refunds": {
      "object": "list",
      "data": [],
      "has_more": false,
      "total_count": 0,
      "url": "/v1/charges/ch_1HzfzLdummy4yFq78N8g/refunds"
    },
    "review": null,
    "shipping": null,
    "source": null,
    "source_transfer": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
  },
  {
    "id": "ch_1HzfzLdummy4yFq78N8g",
    "object": "charge",
    "amount": 24900,
    "amount_captured": 24900,
    "amount_refunded": 0,
    "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
    "application_fee": null,
    "application_fee_amount": null,
    "balance_transaction": {
      "id": "txn_1HzfzdummyY1CMVhu",
      "object": "balance_transaction",
      "amount": 247841,
      "available_on": 1608854400,
      "created": 1608286507,
      "currency": "sek",
      "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
      "exchange_rate": 9.95347,
      "fee": 3650,
      "fee_details": [
        {
          "amount": 3650,
          "application": null,
          "currency": "sek",
          "description": "Stripe processing fees",
          "type": "stripe_fee"
        }
      ],
      "net": 244191,
      "reporting_category": "charge",
      "source": {
        "id": "ch_1HzfzLdummy4yFq78N8g",
        "object": "charge",
        "amount": 24900,
        "amount_captured": 24900,
        "amount_refunded": 0,
        "application": "ca_3oiFU62JYdummynBL0ept0UZo23o",
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_1HzfzMdummyyY1CMVhu",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": null,
          "name": null,
          "phone": null
        },
        "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
        "captured": true,
        "created": 1608286507,
        "currency": "eur",
        "customer": "cus_IariEjS2GmHx4Q",
        "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": true,
        "metadata": {
          "order_id": "20498975",
          "first_name": "dummy",
          "last_name": "dummy",
          "email": "dummy@example.com",
          "ip_address": "127.0.0.1",
          "company_or_organisation": "Company of Sweden",
          "country": "FR"
        },
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_1HzfzdummyKqUb2QX",
        "payment_method": "pm_1HzfzdummyRT944WU5HmfV",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "FR",
            "exp_month": 12,
            "exp_year": 2022,
            "fingerprint": "9pkeomJm2vka5hMa",
            "funding": "credit",
            "installments": null,
            "last4": "5888",
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": "1699-7914",
        "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1HzfzLdummy4yFq78N8g/rcpt_IariaXFSdPG1xnI17OkxV4HnBBJON6r",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_1HzfzLdummy4yFq78N8g/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      },
      "status": "available",
      "type": "charge"
    },
    "billing_details": {
      "address": {
        "city": null,
        "country": null,
        "line1": null,
        "line2": null,
        "postal_code": null,
        "state": null
      },
      "email": null,
      "name": null,
      "phone": null
    },
    "calculated_statement_descriptor": "ACADEMY.EICORN.COM",
    "captured": true,
    "created": 1608286507,
    "currency": "eur",
    "customer": "cus_dummyS2GmHx4Q",
    "description": "ORD001735: ISO 56002 Innovation Management - Eicorn Academy",
    "destination": null,
    "dispute": null,
    "disputed": false,
    "failure_code": null,
    "failure_message": null,
    "fraud_details": {},
    "invoice": null,
    "livemode": true,
    "metadata": {
      "order_id": "20498975",
      "first_name": "Ramona",
      "last_name": "Ungureanu",
      "email": "dummy@example.com",
      "ip_address": "192.168.0.1",
      "company_or_organisation": "Company of Sweden",
      "country": "FR"
    },
    "on_behalf_of": null,
    "order": null,
    "outcome": {
      "network_status": "approved_by_network",
      "reason": null,
      "risk_level": "normal",
      "seller_message": "Payment complete.",
      "type": "authorized"
    },
    "paid": true,
    "payment_intent": "pi_1HzfzLBqiGHfRT94AKqUb2QX",
    "payment_method": "pm_1HzfzdummyRT944WU5HmfV",
    "payment_method_details": {
      "card": {
        "brand": "visa",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": null,
          "cvc_check": "pass"
        },
        "country": "FR",
        "exp_month": 12,
        "exp_year": 2022,
        "fingerprint": "dummy",
        "funding": "credit",
        "installments": null,
        "last4": "5888",
        "network": "visa",
        "three_d_secure": null,
        "wallet": null
      },
      "type": "card"
    },
    "receipt_email": null,
    "receipt_number": "1699-7914",
    "receipt_url": "https://pay.stripe.com/receipts/acct_1dummyfRT94/ch_1HdummyFq78N8g/rcpt_IariaXdummynBBJON6r",
    "refunded": false,
    "refunds": {
      "object": "list",
      "data": [],
      "has_more": false,
      "total_count": 0,
      "url": "/v1/charges/ch_1HzfzLdummy4yFq78N8g/refunds"
    },
    "review": null,
    "shipping": null,
    "source": null,
    "source_transfer": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
  }
]
